{
    "blogs": [
        {
            "id": 1,
            "title": "what is the purpose of react router",
            "shortDes": "React Router is a standard library for routing in React. It enables the navigation among views of various components in a React Application......",
            "content": "<p>React Router is a standard library for routing in React. It enables the navigation among views of various components in a React Application, allows changing the browser URL, and keeps the UI in sync with the URL</p>"
        },
        {
            "id": 2,
            "title": "How does context API works",
            "shortDes": "The React Context API is a way for a React app to effectively produce global variables that can be passed around. This is the alternative to or.....",
            "content": "<p>The React Context API is a way for a React app to effectively produce global variables that can be passed around. This is the alternative to or moving props from grandparent to child to parent, and so on. Context is also touted as an easier, lighter approach to state management using Redux..</p>"
        },
        {
            "id": 3,
            "title": "what is useref hook in react?And how does it works?",
            "shortDes": "The useRef Hook allows you to persist values between renders. It can be used to store a mutable value that does not cause a re-render when updated. It can be used to access a DOM element directly.....?",
            "content": "<p>The useRef Hook allows you to persist values between renders. It can be used to store a mutable value that does not cause a re-render when updated. It can be used to access a DOM element directly. <br/> Works: useRef returns a mutable ref object whose .current property is initialized to the passed argument ( initialValue ). The returned object will persist for the full lifetime of the component. Essentially, useRef is like a “box” that can hold a mutable value in its .current property.</p>"
        }
    ]
}